logs/sysbench/thread_rw2_20190521194211.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 2 tps: 107.25 qps: 1717.18 (r/w/o: 1073.45/429.02/214.71) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 161.70 qps: 2587.66 (r/w/o: 1617.47/646.79/323.39) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 181.00 qps: 2895.94 (r/w/o: 1809.62/724.41/361.90) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 163.80 qps: 2621.21 (r/w/o: 1638.31/655.20/327.70) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 104.30 qps: 1667.80 (r/w/o: 1042.40/416.80/208.60) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 99.10 qps: 1587.60 (r/w/o: 992.30/397.10/198.20) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            81740
        write:                           32696
        other:                           16348
        total:                           130784
    transactions:                        8174   (136.19 per sec.)
    queries:                             130784 (2179.12 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0127s
    total number of events:              8174

Latency (ms):
         min:                                  3.56
         avg:                                 14.68
         max:                                110.79
         95th percentile:                     37.56
         sum:                             119990.22

Threads fairness:
    events (avg/stddev):           4087.0000/129.00
    execution time (avg/stddev):   59.9951/0.00