logs/sysbench/thread_rw4_20190521194211.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 147.74 qps: 2367.77 (r/w/o: 1480.45/591.44/295.87) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 138.50 qps: 2215.35 (r/w/o: 1384.23/554.11/277.01) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 148.30 qps: 2372.73 (r/w/o: 1483.16/592.98/296.59) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 190.90 qps: 3056.74 (r/w/o: 1910.52/764.41/381.80) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 151.10 qps: 2416.28 (r/w/o: 1510.29/603.80/302.20) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 145.30 qps: 2325.31 (r/w/o: 1453.70/581.00/290.60) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            92230
        write:                           36892
        other:                           18446
        total:                           147568
    transactions:                        9223   (153.65 per sec.)
    queries:                             147568 (2458.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0201s
    total number of events:              9223

Latency (ms):
         min:                                  4.26
         avg:                                 26.02
         max:                                176.33
         95th percentile:                     58.92
         sum:                             240018.95

Threads fairness:
    events (avg/stddev):           2305.7500/51.68
    execution time (avg/stddev):   60.0047/0.00